Обработки/Reports/_ОтчетОФактахИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОФактахИнвестирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОФактахИнвестирования/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о фактах инвестирования ",
		"0.24",
		"",
		Истина);
	
	// Команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
КонецФункции

Процедура Сформировать(Результат, СоответствиеИННКлиентов) Экспорт
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "НачалоПериода,КонецПериода,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Результат.Очистить();
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВыводитьЦенныеБумаги = (ЭтотОбъект.КонецПериода < Дата("20210531"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода"				, ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"				, ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ВидУчета"					, ?(БухгалтерскийУчет.ВедетсяУчетЕПС(ЭтотОбъект.КонецПериода, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления), Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, Перечисления.ВидыУчета.БухгалтерскийУчет));
	Запрос.УстановитьПараметр("ВыводитьЦенныеБумаги"		, ВыводитьЦенныеБумаги);
	
	#Область Реквизиты_шапки
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК ЮрФизЛицоКлиента,
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация.ЮрФизЛицо КАК ЮрФизЛицоОрганизации,
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация КАК Организация
		|ПОМЕСТИТЬ _ЮрФизЛица
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеквизитыКлиента.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеКлиента,
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеОрганизации,
		|	РеквизитыОрганизации.ЮридическийАдрес КАК ЮридическийАдрес,
		|	РеквизитыОрганизации.МестоНахождения КАК МестоНахождения,
		|	РеквизитыОрганизации.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	РеквизитыОрганизации.Телефоны КАК Телефоны,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	РеквизитыКлиента.ИНН КАК ИННКлиента
		|ПОМЕСТИТЬ _РеквизитыШапки
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И (Организация, ЮрФизЛицо) В
		|					(ВЫБРАТЬ
		|						_ЮрФизЛица.Организация КАК Организация,
		|						_ЮрФизЛица.ЮрФизЛицоОрганизации КАК ЮрФизЛицоОрганизации
		|					ИЗ
		|						_ЮрФизЛица КАК _ЮрФизЛица)) КАК РеквизитыОрганизации,
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И (Организация, ЮрФизЛицо) В
		|					(ВЫБРАТЬ
		|						_ЮрФизЛица.Организация КАК Организация,
		|						_ЮрФизЛица.ЮрФизЛицоКлиента КАК ЮрФизЛицоКлиента
		|					ИЗ
		|						_ЮрФизЛица КАК _ЮрФизЛица)) КАК РеквизитыКлиента,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	#КонецОбласти
	Запрос.Выполнить();
		
	ТаблицаРеквизитовШапки = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_РеквизитыШапки").Выгрузить();
	
	Если ТаблицаРеквизитовШапки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные по выбранному счету доверительного управления");
		Возврат;
	КонецЕсли;
	
	РеквизитыШапки = ТаблицаРеквизитовШапки[0];
	
	#КонецОбласти
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент КАК ДепозитныйВклад,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.Период КАК ДатаРазмещения,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СуммаПриход КАК СтоимостьОбъекта,
		|	МАКСИМУМ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий) КАК ПериодПроцентов
		|ПОМЕСТИТЬ ВТДепозиты1
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментов
		|		ПО ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И (УсловияКредитныхИнструментов.Процент <> 0)
		|			И (УсловияКредитныхИнструментов.Действует)
		|			И (ДенежныеСредстваВКредитныхИнструментахОбороты.Регистратор ССЫЛКА Документ.ВыводКредитногоИнструмента
		|					И РАЗНОСТЬДАТ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий, ДенежныеСредстваВКредитныхИнструментахОбороты.Период, ДЕНЬ) > 0
		|				ИЛИ ДенежныеСредстваВКредитныхИнструментахОбороты.Регистратор ССЫЛКА Документ.РазмещениеКредитногоИнструмента
		|					И РАЗНОСТЬДАТ(УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий, ДенежныеСредстваВКредитныхИнструментахОбороты.Период, ДЕНЬ) >= -1)
		|ГДЕ
		|	(ДенежныеСредстваВКредитныхИнструментахОбороты.Регистратор ССЫЛКА Документ.ВыводКредитногоИнструмента
		|			ИЛИ ДенежныеСредстваВКредитныхИнструментахОбороты.Регистратор ССЫЛКА Документ.РазмещениеКредитногоИнструмента)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.Период,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.КредитныйИнструмент,
		|	ДенежныеСредстваВКредитныхИнструментахОбороты.СуммаПриход
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТДепозиты.ДепозитныйВклад КАК ДепозитныйВклад,
		|	ВТДепозиты.ДатаРазмещения КАК ДатаРазмещения,
		|	ВТДепозиты.СтоимостьОбъекта КАК СтоимостьОбъекта,
		|	УсловияКредитныхИнструментов.Процент КАК Ставка,
		|	УсловияКредитныхИнструментов.ДатаПогашения КАК ДатаПогашения
		|ПОМЕСТИТЬ ВТДепозиты2
		|ИЗ
		|	ВТДепозиты1 КАК ВТДепозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&КонецПериода, ) КАК УсловияКредитныхИнструментов
		|		ПО ВТДепозиты.ДепозитныйВклад = УсловияКредитныхИнструментов.КредитныйИнструмент
		|			И ВТДепозиты.ПериодПроцентов = УсловияКредитныхИнструментов.ДатаНачалаДействияУсловий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Отбор.ДепозитныйВклад КАК ДепозитныйВклад,
		|	СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|	СредневзвешенныеПроцентныеСтавки.Вид КАК Вид,
		|	СредневзвешенныеПроцентныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|	СредневзвешенныеПроцентныеСтавки.ВидШкалы КАК ВидШкалы,
		|	СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|	СредневзвешенныеПроцентныеСтавки.Валюта КАК Валюта,
		|	СредневзвешенныеПроцентныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _ДействующиеСредневзвешенныеСтавки
		|ИЗ
		|	РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТДепозиты2.ДепозитныйВклад КАК ДепозитныйВклад,
		|			СредневзвешенныеПроцентныеСтавки.Вид КАК Вид,
		|			СредневзвешенныеПроцентныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|			СредневзвешенныеПроцентныеСтавки.ВидШкалы КАК ВидШкалы,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.Валюта КАК Валюта,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца КАК НачалоРасчетногоМесяца,
		|			МАКСИМУМ(СредневзвешенныеПроцентныеСтавки.Период) КАК Период
		|		ИЗ
		|			ВТДепозиты2 КАК ВТДепозиты2
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СредневзвешенныеПроцентныеСтавки КАК СредневзвешенныеПроцентныеСтавки
		|				ПО ВТДепозиты2.ДатаРазмещения >= СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца
		|					И ВТДепозиты2.ДатаРазмещения >= СредневзвешенныеПроцентныеСтавки.Период
		|					И (СредневзвешенныеПроцентныеСтавки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСредневзвешенныхСтавок.ПоДепозитамНФО))
		|					И (СредневзвешенныеПроцентныеСтавки.ГруппаБанков = ЗНАЧЕНИЕ(Перечисление.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки.ВсеБанкиРФ))
		|					И (СредневзвешенныеПроцентныеСтавки.ВидШкалы = ЗНАЧЕНИЕ(Перечисление.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам.Развернутая))
		|					И (СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы = ВЫБОР
		|						КОГДА РАЗНОСТЬДАТ(ВТДепозиты2.ДатаРазмещения, ВТДепозиты2.ДатаПогашения, ДЕНЬ) <= 30
		|								ИЛИ ВТДепозиты2.ДепозитныйВклад.ДоВостребования
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.До30ДнейВключаяДоВостребования)
		|						КОГДА РАЗНОСТЬДАТ(ВТДепозиты2.ДатаРазмещения, ВТДепозиты2.ДатаПогашения, ДЕНЬ) <= 90
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От31До90Дней)
		|						КОГДА РАЗНОСТЬДАТ(ВТДепозиты2.ДатаРазмещения, ВТДепозиты2.ДатаПогашения, ДЕНЬ) <= 180
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От91До180Дней)
		|						КОГДА ДОБАВИТЬКДАТЕ(ВТДепозиты2.ДатаРазмещения, ГОД, 1) >= ВТДепозиты2.ДатаПогашения
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От181ДняДо1Года)
		|						КОГДА ДОБАВИТЬКДАТЕ(ВТДепозиты2.ДатаРазмещения, ГОД, 3) >= ВТДепозиты2.ДатаПогашения
		|							ТОГДА ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.От1ГодаДо3Лет)
		|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИнтервалыШкалСредневзвешенныхПроцентныхСтавокПоДепозитам.Свыше3Лет)
		|					КОНЕЦ)
		|					И (СредневзвешенныеПроцентныеСтавки.Валюта = ВТДепозиты2.ДепозитныйВклад.БанковскийСчет.Валюта)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВТДепозиты2.ДепозитныйВклад,
		|			СредневзвешенныеПроцентныеСтавки.Вид,
		|			СредневзвешенныеПроцентныеСтавки.ГруппаБанков,
		|			СредневзвешенныеПроцентныеСтавки.ВидШкалы,
		|			СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы,
		|			СредневзвешенныеПроцентныеСтавки.Валюта,
		|			СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца) КАК Отбор
		|		ПО (Отбор.Вид = СредневзвешенныеПроцентныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = СредневзвешенныеПроцентныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = СредневзвешенныеПроцентныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = СредневзвешенныеПроцентныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = СредневзвешенныеПроцентныеСтавки.Валюта)
		|			И (Отбор.НачалоРасчетногоМесяца = СредневзвешенныеПроцентныеСтавки.НачалоРасчетногоМесяца)
		|			И (Отбор.Период = СредневзвешенныеПроцентныеСтавки.Период)
		|ГДЕ
		|	СредневзвешенныеПроцентныеСтавки.Действует
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДействующиеСредневзвешенныеСтавки.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_ДействующиеСредневзвешенныеСтавки.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _СредневзвешенныеСтавки
		|ИЗ
		|	_ДействующиеСредневзвешенныеСтавки КАК _ДействующиеСредневзвешенныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДействующиеСредневзвешенныеСтавки.ДепозитныйВклад КАК ДепозитныйВклад,
		|			_ДействующиеСредневзвешенныеСтавки.Вид КАК Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков КАК ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы КАК ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы КАК ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта КАК Валюта,
		|			МАКСИМУМ(_ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца) КАК НачалоРасчетногоМесяца
		|		ИЗ
		|			_ДействующиеСредневзвешенныеСтавки КАК _ДействующиеСредневзвешенныеСтавки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДействующиеСредневзвешенныеСтавки.ДепозитныйВклад,
		|			_ДействующиеСредневзвешенныеСтавки.Вид,
		|			_ДействующиеСредневзвешенныеСтавки.ГруппаБанков,
		|			_ДействующиеСредневзвешенныеСтавки.ВидШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы,
		|			_ДействующиеСредневзвешенныеСтавки.Валюта) КАК Отбор
		|		ПО (Отбор.ДепозитныйВклад = _ДействующиеСредневзвешенныеСтавки.ДепозитныйВклад)
		|			И (Отбор.Вид = _ДействующиеСредневзвешенныеСтавки.Вид)
		|			И (Отбор.ГруппаБанков = _ДействующиеСредневзвешенныеСтавки.ГруппаБанков)
		|			И (Отбор.ВидШкалы = _ДействующиеСредневзвешенныеСтавки.ВидШкалы)
		|			И (Отбор.ИнтервалШкалы = _ДействующиеСредневзвешенныеСтавки.ИнтервалШкалы)
		|			И (Отбор.Валюта = _ДействующиеСредневзвешенныеСтавки.Валюта)
		|			И (Отбор.НачалоРасчетногоМесяца = _ДействующиеСредневзвешенныеСтавки.НачалоРасчетногоМесяца)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КотировкиТорговыхПлощадокСводные.Период КАК Период,
		|	КотировкиТорговыхПлощадокСводные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КотировкиТорговыхПлощадокСводные.РежимТоргов КАК РежимТоргов,
		|	КотировкиТорговыхПлощадокСводные.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводные.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ВалютныеПары), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Опционы), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы))
		|			ТОГДА КотировкиТорговыхПлощадокСводные.ЦеннаяБумага.Валюта
		|		КОГДА КотировкиТорговыхПлощадокСводные.Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Векселя), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))
		|			ТОГДА КотировкиТорговыхПлощадокСводные.ЦеннаяБумага.ВалютаНоминала
		|		КОГДА КотировкиТорговыхПлощадокСводные.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ДепозитарныеРасписки)
		|			ТОГДА КотировкиТорговыхПлощадокСводные.ЦеннаяБумага.БазоваяЦБ.ВалютаНоминала
		|	КОНЕЦ КАК ВалютаНоминала,
		|	ВЫБОР
		|		КОГДА КотировкиТорговыхПлощадокСводные.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА КотировкиТорговыхПлощадокСводные.MARKETPRICE2
		|		ИНАЧЕ КотировкиТорговыхПлощадокСводные.MARKETPRICE2 * (КурсыВалют.Курс / КурсыВалют.Кратность)
		|	КОНЕЦ КАК MARKETPRICE2,
		|	КотировкиТорговыхПлощадокСводные.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ПоследниеКотировкиПоПериодам
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			День,
		|			&ВыводитьЦенныеБумаги
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадокСводные КАК КотировкиТорговыхПлощадокСводные
		|		ПО (КотировкиТорговыхПлощадокСводные.РежимТоргов.ОсновнойРежим)
		|			И БухПартииЦенныхБумагОбороты.Период = КотировкиТорговыхПлощадокСводные.Период
		|			И БухПартииЦенныхБумагОбороты.ЦеннаяБумага = КотировкиТорговыхПлощадокСводные.ЦеннаяБумага
		|			И (КотировкиТорговыхПлощадокСводные.Биржа = &ОсновнаяБиражаДляКотировок)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КотировкиТорговыхПлощадокСводные.Период = КурсыВалют.Период)
		|			И (КотировкиТорговыхПлощадокСводные.Валюта = КурсыВалют.Валюта)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПоследниеКотировкиПоПериодам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПоследниеКотировкиПоПериодам.Период КАК Период,
		|	МАКСИМУМ(_ПоследниеКотировкиПоПериодам.MARKETPRICE2_DATE) КАК MARKETPRICE2_DATE
		|ПОМЕСТИТЬ _ДатыПоследнихЗначенийКотировок
		|ИЗ
		|	_ПоследниеКотировкиПоПериодам КАК _ПоследниеКотировкиПоПериодам
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировкиПоПериодам.ЦеннаяБумага,
		|	_ПоследниеКотировкиПоПериодам.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ПоследниеКотировкиПоПериодам.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ПоследниеКотировкиПоПериодам.Период КАК Период,
		|	_ПоследниеКотировкиПоПериодам.MARKETPRICE2_DATE КАК MARKETPRICE2_DATE,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(_ПоследниеКотировкиПоПериодам.Валюта = _ПоследниеКотировкиПоПериодам.ВалютаНоминала)
		|			ТОГДА МАКСИМУМ(ВЫБОР
		|						КОГДА _ПоследниеКотировкиПоПериодам.Валюта = _ПоследниеКотировкиПоПериодам.ВалютаНоминала
		|							ТОГДА _ПоследниеКотировкиПоПериодам.MARKETPRICE2
		|					КОНЕЦ)
		|		ИНАЧЕ МАКСИМУМ(_ПоследниеКотировкиПоПериодам.MARKETPRICE2)
		|	КОНЕЦ КАК MARKETPRICE2
		|ПОМЕСТИТЬ _КотировкиЦенныхБумаг
		|ИЗ
		|	_ПоследниеКотировкиПоПериодам КАК _ПоследниеКотировкиПоПериодам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатыПоследнихЗначенийКотировок КАК ДатыПоследнихЗначенийMARKETPRICE2
		|		ПО _ПоследниеКотировкиПоПериодам.ЦеннаяБумага = ДатыПоследнихЗначенийMARKETPRICE2.ЦеннаяБумага
		|			И _ПоследниеКотировкиПоПериодам.Период = ДатыПоследнихЗначенийMARKETPRICE2.Период
		|			И _ПоследниеКотировкиПоПериодам.MARKETPRICE2_DATE = ДатыПоследнихЗначенийMARKETPRICE2.MARKETPRICE2_DATE
		|
		|СГРУППИРОВАТЬ ПО
		|	_ПоследниеКотировкиПоПериодам.ЦеннаяБумага,
		|	_ПоследниеКотировкиПоПериодам.Период,
		|	_ПоследниеКотировкиПоПериодам.MARKETPRICE2_DATE
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Депозит"" КАК ВидАктива,
		|	ВТДепозиты2.ДепозитныйВклад КАК НаименованиеОбъекта,
		|	ВТДепозиты2.ДатаРазмещения КАК ДатаПриобретения,
		|	ВТДепозиты2.СтоимостьОбъекта КАК СтоимостьПриобретения,
		|	ВТДепозиты2.Ставка КАК ЦенаПриобретения,
		|	ВТДепозиты2.ДепозитныйВклад.БанковскийСчет.Банк.ЮрФизЛицо КАК Эмитент,
		|	_СредневзвешенныеСтавки.ПроцентнаяСтавка КАК РыночнаяЦена
		|ПОМЕСТИТЬ ВТ_Отчет1
		|ИЗ
		|	ВТДепозиты2 КАК ВТДепозиты2
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СредневзвешенныеСтавки КАК _СредневзвешенныеСтавки
		|		ПО ВТДепозиты2.ДепозитныйВклад = _СредневзвешенныеСтавки.ДепозитныйВклад
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ЦБ"",
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОбороты.Период,
		|	БухПартииЦенныхБумагОбороты.СтоимостьПокупкиПриход,
		|	БухПартииЦенныхБумагОбороты.СтоимостьПокупкиПриход / БухПартииЦенныхБумагОбороты.КоличествоПриход,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	_КотировкиЦенныхБумаг.MARKETPRICE2
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			&ВыводитьЦенныеБумаги
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И ВидУчета = &ВидУчета) КАК БухПартииЦенныхБумагОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КотировкиЦенныхБумаг КАК _КотировкиЦенныхБумаг
		|		ПО БухПартииЦенныхБумагОбороты.ЦеннаяБумага = _КотировкиЦенныхБумаг.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОбороты.Период = _КотировкиЦенныхБумаг.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОбороты.Период,
		|	БухПартииЦенныхБумагОбороты.СтоимостьПокупкиПриход,
		|	БухПартииЦенныхБумагОбороты.СтоимостьПокупкиПриход / БухПартииЦенныхБумагОбороты.КоличествоПриход,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага.Эмитент.ЮрФизЛицо,
		|	_КотировкиЦенныхБумаг.MARKETPRICE2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Отчет1.ВидАктива КАК ВидАктива,
		|	ВТ_Отчет1.НаименованиеОбъекта КАК НаименованиеОбъекта,
		|	ВТ_Отчет1.ДатаПриобретения КАК ДатаПриобретения,
		|	ВТ_Отчет1.СтоимостьПриобретения КАК СтоимостьПриобретения,
		|	ВТ_Отчет1.ЦенаПриобретения КАК ЦенаПриобретения,
		|	ВТ_Отчет1.Эмитент КАК Эмитент,
		|	МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК ПериодРеквизитов,
		|	ВТ_Отчет1.РыночнаяЦена КАК РыночнаяЦена
		|ПОМЕСТИТЬ ВТ_Отчет2
		|ИЗ
		|	ВТ_Отчет1 КАК ВТ_Отчет1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО ВТ_Отчет1.Эмитент = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВТ_Отчет1.ДатаПриобретения >= РеквизитыЮридическихЛиц.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Отчет1.ДатаПриобретения,
		|	ВТ_Отчет1.Эмитент,
		|	ВТ_Отчет1.НаименованиеОбъекта,
		|	ВТ_Отчет1.ВидАктива,
		|	ВТ_Отчет1.ЦенаПриобретения,
		|	ВТ_Отчет1.СтоимостьПриобретения,
		|	ВТ_Отчет1.РыночнаяЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Отчет2.ВидАктива КАК ВидАктива,
		|	ВТ_Отчет2.НаименованиеОбъекта КАК НаименованиеОбъекта,
		|	ВТ_Отчет2.ДатаПриобретения КАК ДатаПриобретения,
		|	ВТ_Отчет2.СтоимостьПриобретения КАК СтоимостьПриобретения,
		|	ВТ_Отчет2.ЦенаПриобретения КАК ЦенаПриобретения,
		|	ВТ_Отчет2.Эмитент КАК Эмитент,
		|	РеквизитыЮридическихЛиц.ИНН КАК ИННЭмитента,
		|	ВТ_Отчет2.РыночнаяЦена КАК РыночнаяЦена
		|ПОМЕСТИТЬ _ТаблицаОтчета
		|ИЗ
		|	ВТ_Отчет2 КАК ВТ_Отчет2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|		ПО ВТ_Отчет2.Эмитент = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|			И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|			И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|			И ВТ_Отчет2.ПериодРеквизитов = РеквизитыЮридическихЛиц.Период
		|ГДЕ
		|	(РеквизитыЮридическихЛиц.ИНН ЕСТЬ NULL
		|			ИЛИ РеквизитыЮридическихЛиц.ИНН В (&МассивИННЭмитентов)
		|			ИЛИ РеквизитыЮридическихЛиц.ИНН = """")";
	#КонецОбласти
	
	МассивИННЭмитентов = Новый Массив;
	ДатаСоответствия = Дата(1, 1, 1);
	
	Если СоответствиеИННКлиентов.Получить(РеквизитыШапки.ИННКлиента) <> Неопределено Тогда
		СоответствиеДат = СоответствиеИННКлиентов.Получить(РеквизитыШапки.ИННКлиента);
		Для Каждого Элемент Из СоответствиеДат Цикл
			Если Элемент.Ключ <= КонецПериода Тогда
				ДатаСоответствия = Макс(ДатаСоответствия, Элемент.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Если ДатаСоответствия <> Дата(1, 1, 1) Тогда
			МассивИННЭмитентов = СоответствиеДат.Получить(ДатаСоответствия);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивИННЭмитентов", МассивИННЭмитентов);
	Запрос.УстановитьПараметр("ОсновнаяБиражаДляКотировок", Константы.ОсновнаяБиржаДляКотировок.Получить());
	
	Запрос.Выполнить();
	
	Макет = ПолучитьМакет("МакетОтчета");
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаДепозиты	= Макет.ПолучитьОбласть("СтрокаДепозиты");
	ОбластьСтрокаЦБ			= Макет.ПолучитьОбласть("СтрокаЦБ");
	
	ОбластьШапка.Параметры.Заполнить(РеквизитыШапки);
	ОбластьШапка.Параметры.ДатаЗаключения = Формат(РеквизитыШапки.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	
	Результат.Вывести(ОбластьШапка);
	
	ТаблицаОтчета = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ТаблицаОтчета").Выгрузить();
	
	Для Каждого СтрокаОтчета Из ТаблицаОтчета Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаОтчета.Эмитент) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СтрокаОтчета.ВидАктива + " " + СокрЛП(СтрокаОтчета.НаименованиеОбъекта) + " не указан эмитент");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаОтчета.ИННЭмитента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У эмитента """ + СокрЛП(СтрокаОтчета.Эмитент) + """ не указан ИНН!");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаОтчета.РыночнаяЦена) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + СтрокаОтчета.ВидАктива + " " + СокрЛП(СтрокаОтчета.НаименованиеОбъекта) + " отсутствует " + ?(СтрокаОтчета.ВидАктива = "Депозит", "средняя рыночная ставка!", " рыночная цена"));
		КонецЕсли;
		
	КонецЦикла;
	
	#Область Депозиты
	
	ТаблицаДепозиты = ТаблицаОтчета.НайтиСтроки(Новый Структура("ВидАктива", "Депозит"));
	
	Результат.Вывести(Макет.ПолучитьОбласть("ШапкаДепозиты"));
	Для Каждого СтрокаДепозиты Из ТаблицаДепозиты Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаДепозиты.Параметры, СтрокаДепозиты);
		Результат.Вывести(ОбластьСтрокаДепозиты);
	КонецЦикла;
	
	Результат.Вывести(Макет.ПолучитьОбласть("ПодвалДепозиты"));
	
	#КонецОбласти	
	
	#Область Ценные_бумаги
	
	Если ВыводитьЦенныеБумаги Тогда
		ТаблицаЦБ = ТаблицаОтчета.НайтиСтроки(Новый Структура("ВидАктива", "ЦБ"));
		Результат.Вывести(Макет.ПолучитьОбласть("ШапкаЦБ"));
		Для Каждого СтрокаЦБ Из ТаблицаЦБ Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаЦБ.Параметры, СтрокаЦБ);
			Результат.Вывести(ОбластьСтрокаЦБ);
		КонецЦикла;
	КонецЕсли;
	
	#КонецОбласти
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.Подписант = ЭтотОбъект.Подписант.КонтактноеЛицо;
	ОбластьПодвал.Параметры.ДолжностьПодписанта = ЭтотОбъект.Подписант.Должность;
	
	Результат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
